Tekla Open API Reference for Tekla Structures 2025
GeometryConstants Fields
The GeometryConstants type exposes the following members.
Fields
Name | Description
ANGULAR_EPSILON
 The minimum angle (radians) used for checking angular parallelism, perpendicularity, etc. Anything smaller will be considered equivalent to 0.0.
DISTANCE_EPSILON
 The minimum distance used for checking if points, lines, etc. coincide. Anything smaller will be considered equivalent to 0.0.
SCALAR_EPSILON
 The minimum value used for comparing floating point scalar values. Any smaller difference will be considered equivalent to 0.0.
Top
See Also
Reference
GeometryConstants Class
Tekla.Structures.Geometry3d Namespace